#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//不允许创建临时变量，求字符串长度 递归
//int my_strlen(char* str)
//{
//	if (*str != '\0')
//	{
//		return 1 + my_strlen(str + 1);
//	}
//	else
//	{
//		return 0;
//	}
//}
//
//int main()
//{
//	char arr[] = "spider";
//	printf("%d ", my_strlen(arr));
//	return 0;
//}
//--------------------------------------------------------------------------------------------------------------------


//递归函数：求输入数字的阶乘
//int count(int n)
//{
//	if (n != 0)
//	{
//		return n*count(n - 1);
//	}
//	return 1;
//}
//
//int main()
//{
//	int a = 0;
//	printf("请输入要求阶乘的数字；\n");
//	scanf("%d", &a);
//	printf("%d",count(a));
//	return 0;
//}
//-----------------------------------------------------------------------------------------------------------------


//计算第n个斐波那契数	迭代
//int sum(int n)
//{
//	int i = 1;
//	int j = 1;
//	int k = 1;
//	while(n > 2)
//	{
//		k = i + j;
//		i = j;
//		j = k;
//		n--;
//	}
//	return k;
//}
//
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	printf("%d", sum(a));
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------


//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d%d", &a,&b);
//	printf("%d*%d = %d", a, b, a*b);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------


//一维数组
//int main()
//{
//	char ch[] = { 'a','b','c'};
//	printf("%d\n", strlen(ch));
//	char ch1[5] = { 'a','b','c','d'};
//	printf("%d", strlen(ch1));
//
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------


//二维数组
//int main()
//{
//	//创建
//	int arr1[3][4];//未初始化
//	int arr2[2][3] = { 1,2,3,4,5,6 };//完全初始化
//	int arr3[2][3] = { 1,2,3};//不完全初始化
//	int arr4[3][2] = { {1,2},{3,4},{5,6} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 2; j++)
//		{
//			printf("%d ", arr4[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------



//冒泡排序
//int main()
//{
//	int x = 0;
//	int a = 0;
//	int b = 0;
//	int temp = 0;
//	int arr[] = {9,8,7,6,5,4,3,2,1,0};
//	//求出数组的长度
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//实现排序
//	for (a = 0; a < sz-1; a++)
//	{
//		int i = 0;
//		int j = 1;
//		for (b = 0; b < sz - 1 - a; b++)
//		{
//			if (arr[i] > arr[j])
//			{
//				temp = arr[i];
//				arr[i] = arr[j];
//				arr[j] = temp;
//			}
//			if (i < sz-1 && j < sz-1)
//			{
//				i++;
//				j++;
// 			}
//			else 
//			{
//				break;
//			}
//		}
//	}
//	//排序完成打印输出
//	for (x = 0; x < sz; x++)
//	{
//		printf("%d ", arr[x]);
//	}
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------


//冒泡排序-->优化
//void sort(int ar[], int s)
//{
//	int c = 0;
//	//一共要进行s-1次排序
//	for (c = 0; c < s - 1; c++)
//	{
//		int b = 0;
//		//一次排序有几对数字要比较
//		for (b = 0; b < s - 1 - c; b++)
//		{
//			//交换
//			if (ar[b] > ar[b + 1])
//			{
//				int temp = ar[b];
//				ar[b] = ar[b + 1];
//				ar[b + 1] = temp;
//			}
//		}
//	}
//}
//
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//调用排序函数
//	sort(arr,sz);
//	//打印输出排序后的数组
//	for (int i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

int  spider(int* x)
{
	return ++(*x);
}

int main()
{
	int num = 1;
	spider(&num);
	spider(&num);
	printf("%d", num);
	return 0;
}













