#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//	const 修饰的常变量
//int main()
//{

//	int a = 1;
//	a = 2;
//	const int b = 1;
//	b = 2;//err
//	printf("b = %d", b);
//	printf("a = %d", a);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------


//define 定义的标识符常量
//#define MAX 100
//int main()
//{
//	MAX = 200;//err
//	printf("MAX = %d", MAX);
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------


//enum枚举常量
//enum Color
//{
//	//枚举未来的可能性
//	//枚举常量
//	RED,
//	BLUE,
//	PINK
//};
//int main()
//{
//	enum Color c = PINK;
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------


//int main()
//{
//	/*
//	*字符串在结尾的位置隐藏了一个"\0"作为结束标志，不计入字符串内容
//	* \0 转义字符
//	*/
//	char arr1[] = "spider";//默认有一个\0作为结束标志
//	char arr2[] = {'s','p','i','d','e','r',};//没有\0作为结束标志
//
//	//求字符串长度
//
//	printf("%d\n", strlen(arr1));//6
//	printf("%d\n",strlen(arr2));//随机数，一直往后找直到找到 \0 停下
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------


//转义字符
int main()
{

	return 0;
}









