#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////函数交换两个值
//void swap(int* pi, int* pj)
//{
//	int z = 0;
//	z = *pi;
//	*pi = *pj;
//	*pj = z;
//}
//
//int main()
//{
//	int i = 10;
//	int j = 20;
//	swap(&i, &j);
//	printf("i = %d j = %d", i, j);
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


//100 - 200之间的素数
//int prime(int n)
//{
//	int j = 0;
//	for (j = 2; j < n; j++)
//	{
//		if (n % j == 0)
//		{
//			return 0;
//		}
//	}
//	return 1;
//}
//
//int main()
//{
//	int i = 0;
//	for (i = 100; i < 201; i++)
//	{
//		if (prime(i) == 1)
//		{
//			printf("%d ",i);
//		}
//	}
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


//1000 - 2000闰年
//int year(int n)
//{
//	if ((n % 4 == 0 && n % 100 != 0) || (n % 400 == 0))
//	{
//		return 1;
//	}
//	return 0;
//}
//
//int main()
//{
//	int i = 0;
//	for (i = 1000; i < 2001; i++)
//	{
//		if (year(i) == 1)
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


//写一个函数search，实现对有序数组的二分查找
//int search(int arr[], int n, int s)
//{
//	int left = 0;
//	int right = s - 1;
//	int mid = (left + right) / 2;
//	while (left <= right)
//	{
//		if (n > arr[mid])
//		{
//			left = mid++;
//		}
//		else if (n < arr[mid])
//		{
//			right = mid--;
//		}
//		else if(n == arr[mid])
//		{
//			return mid;
//		}
//	}
//	if (left > right)
//	{
//		return s + 1;
//	}
//}
//
//int main()
//{
//	int key = 0;
//	int arr[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	scanf("%d", &key);//输入要查找的数
//	int sz = sizeof(arr) / sizeof(arr[0]);//数组中元素的个数
//	int i = search(arr,key,sz);
//	if (i < sz)
//	{
//		printf("下标为= %d" ,i);
//	}
//	else
//	{
//		printf("查无此数");
//	}
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


//写一个函数，每调用一次这个函数，num的值+1。
//void count(int* pnum)
//{
//	(*pnum)++;
//}
//
//int main()
//{
//	int num = 0;
//	int n = 0;
//	int i = 0;
//	printf("请输入调用几次：");
//	scanf("%d", &n);
//	for (i = 0; i < n; i++)
//	{
//		count(&num);//要想改变变量大小，一定要传地址，一旦涉及到了地址就涉及到了“指针”。
//	}
//	printf("%d", num);
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


//函数的嵌套调用和链式访问
//int main()
//{
//	int len = strlen("abc");
//	printf("%d\n", len);
//
//	//链式访问：将一个函数的返回值当作另一个函数的参数
//	printf("%d\n", strlen("abc"));
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------


// 函数递归 输入1234，打印输出1 2 3 4
/*
* 递归
*/
void res(int n)
 {
	if (n > 9)
	{
		res(n / 10);//递归调用
	}
	printf("%d ", n % 10);
}

int main()
{
	int a = 0;
	scanf("%d", &a);
	res(a);
	return 0;
}
























