#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//#define定义常量和宏
//1.定义符号
//#define MAX 1000
//int main()
//{
//	printf("%d\n", MAX);
//	return 0;
//}
//------------------------------------------------------------------------------------------------------------


//2.定义宏
//#define Add(X,Y) ((X)+(Y))//计算x+y
//int main()
//{
//	printf("%d\n", Add(1, 2));
//	printf("%d\n", 2*Add(1, 2));
//	return 0;
//}
//------------------------------------------------------------------------------------------------------------


//指针
//int main()
//{
//	int a = 1;//在内存中开辟空间
//	printf("%p\n", &a);//%p专门用来打印地址的
//	int* p = &a;//p是用来存放地址的，叫做指针变量
//	//"*"说明p是指针变量
//	//int 说明p执行的对象是int类型的（因为a是int类型)
//
//
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------


//*p解引用
int main()
{
	int i = 1;
	int* p = &i;
	*p = 2;//解引用操作
	printf("%d\n", i);
	return 0;
}











