#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//函数
//int Add(int a, int b)
//{
//	int value = a + b;
//	return value;
//}
//int main()
//{
//	int x = 0;
//	int y = 0;
//	scanf("%d %d", &x, &y);
//	int sum = Add(x, y);
//	printf("value = %d", sum);
//	return 0;
//}
//--------------------------------------------------------------------------------------------------------------------


//数组--一组相同类型的元素的集合
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d\n", arr[i]);
//		i++;
//	}
//	printf("已经结束了");
//	return 0;
//}
//--------------------------------------------------------------------------------------------------------------------

















