#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//转义字符
//int main()
//{
//	// \t被转义成水平制表符(tab键)
//	printf("C:\test\test");//C:      est     est
//	printf("C:\\test\\test");//C:\test\test
//	//
//	return 0;
//------------------------------------------------------------------------------------------------------------------


//选择语句
//int main()
//{
//	int a = 0;
//	printf("敲代码？(1/0)\n");
//	scanf("%d",&a);
//	if (a == 1)
//		printf("牛哇牛哇");
//	else
//		printf("拜拜");
//	return 0;
//}
//------------------------------------------------------------------------------------------------------------------


//while循环语句
//int main()
//{
//	int line = 0;
//	while (line < 10000)//为真进入循环
//	{
//		printf("还不够%d\n", line);
//		line++;
//	}
//	if(line == 10000)
//		printf("不错%d\n",line);
//	return 0;
//}
//------------------------------------------------------------------------------------------------------------------

